configuration/src/InformationRegisters/FileSynchronizationSettings/FileSynchronizationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>FileSynchronizationSettings</name>
  <resources>
    <name>FilterRule</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Synchronize</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IsFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>FileOwner</name>
    <comment>APK:1330 it is not possible to combine 2 composite types</comment>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FileOwnerType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Account</name>
    <type>
      <types>CatalogRef.FileSynchronizationAccounts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/FileSynchronizationSettings/Forms/RecordForm/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("FileOwner") Then
		Record.FileOwner = Parameters.FileOwner;
		
		If Not ValueIsFilled(Parameters.Key) Then
			InitializeComposer();
		EndIf;
		
	EndIf;
	
	If AttributesArrayWithDateType.Count() = 0 Then
		Items.AddConditionByDate.Enabled = False;
	EndIf;
	
	If Parameters.Property("FileOwnerType") Then
		Record.FileOwnerType = Parameters.FileOwnerType;
	EndIf;
	
	If Parameters.Property("IsFile") Then
		Record.IsFile = Parameters.IsFile;
	EndIf;
	
	If Parameters.Property("NewSetting") Then
		NewSetting = Parameters.NewSetting;
	EndIf;
	
	If Record.FileOwner = Undefined Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(Record.Account) Then
		FillSynchronizationAccount();
	EndIf;
	
	FileOwnerNotMetadataObjectsID = TypeOf(Record.FileOwner) <> Type("CatalogRef.MetadataObjectIDs");
	If FileOwnerNotMetadataObjectsID Then
		
		Common.MetadataObjectID(TypeOf(Record.FileOwner));
		SynchronizationObject = "OnlyItemFiles";
		
		FilesOwnerID = Common.MetadataObjectID(TypeOf(Record.FileOwner));
		PresentationFilesOwnerType = Record.FileOwnerType.Description;
		OwnerPresentationForTitle = Common.SubjectString(Record.FileOwner);
		CatalogItem = Record.FileOwner;
		
		ExistingSettingsList.LoadValues(ExistingSynchronizationObjects(TypeOf(Record.FileOwner)));
		
	Else
		
		ExistingSettingsList.LoadValues(ExistingSynchronizationObjects(TypeOf(Record.FileOwner.EmptyRefValue)));
		SynchronizationObject = "AllFiles";
		
		FilesOwnerID = Record.FileOwner;
		PresentationFilesOwnerType = Record.FileOwner.Description;
		OwnerPresentationForTitle = PresentationFilesOwnerType;
		CatalogItem = Record.FileOwner.EmptyRefValue;
		
	EndIf;
	
	If HasSyncRulesSettings(Record.FileOwner) 
		And (NewSetting Or TypeOf(Record.FileOwner) <> Type("CatalogRef.MetadataObjectIDs")) Then
		Items.SyncObjectAllFiles.ReadOnly = True;
		Items.SyncRuleGroup.ReadOnly  = True;
		SynchronizationObject                                 = "OnlyItemFiles";
	EndIf;
	
	Title = NStr("en = 'File synchronization setting:';") + " " + OwnerPresentationForTitle;
	
	Items.SetupRuleFilter.ExtendedTooltip.Title =
		StringFunctionsClientServer.SubstituteParametersToString(Items.SetupRuleFilter.ExtendedTooltip.Title, PresentationFilesOwnerType);
	Items.SyncObjectAllFiles.ChoiceList[0].Presentation = StringFunctionsClientServer.SubstituteParametersToString(Items.SyncObjectAllFiles.ChoiceList[0].Presentation, PresentationFilesOwnerType);
	
	If Common.IsMobileClient() Then
		Items.SetupRuleFilter.Header = False;
		Items.Description.TitleLocation = FormItemTitleLocation.Top;
		Items.SettingRuleFilterColumnGroupApply.Visible = False;
	EndIf;
	
	Items.Account.ReadOnly = Parameters.ForbidChangeAccount;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	SetFormItemEnabled();
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	If ValueIsFilled(CurrentObject.FileOwner) Then
		InitializeComposer();
	EndIf;
	If CurrentObject.FilterRule.Get() <> Undefined Then
		Rule.LoadSettings(CurrentObject.FilterRule.Get());
	EndIf;

EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	
	If SynchronizationObject = "OnlyItemFiles" And Not ValueIsFilled(CatalogItem) Then
		Cancel = True;
		CommonClient.MessageToUser(
			NStr("en = 'The object with attachments is not specified.';"),
			,
			"CatalogItem");
	EndIf;
		
	Record.FileOwner = 
		?(SynchronizationObject = "AllFiles", FilesOwnerID, CatalogItem);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	FilterRule = Rule.GetSettings();
	
	If SynchronizationObject = "OnlyItemFiles" Then
		FilterRule.Filter.Items.Clear();
		CurrentObject.Description = "";
	EndIf;
	
	CurrentObject.FilterRule = New ValueStorage(FilterRule);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	ReturnValue = New Structure;
	
	If SynchronizationObject = "OnlyItemFiles" Then
		ReturnValue.Insert("ObjectDescriptionSynonym", CurrentObject.FileOwner);
		HasFilterRules = False;
	Else
		ReturnValue.Insert("ObjectDescriptionSynonym", FilesOwnerID.Synonym);
		HasFilterRules = Rule.GetSettings().Filter.Items.Count() > 0;
	EndIf;
	ReturnValue.Insert("NewSetting",    NewSetting);
	ReturnValue.Insert("FileOwner",     CurrentObject.FileOwner);
	ReturnValue.Insert("FileOwnerType", CurrentObject.FileOwnerType);
	ReturnValue.Insert("Synchronize",  CurrentObject.Synchronize);
	ReturnValue.Insert("Description",      CurrentObject.Description);
	ReturnValue.Insert("Account",     CurrentObject.Account);
	ReturnValue.Insert("IsFile",           CurrentObject.IsFile);
	ReturnValue.Insert("Rule",           CurrentObject.FilterRule);
	ReturnValue.Insert("HasFilterRules", HasFilterRules);
	
EndProcedure

&AtClient
Procedure ChoiceProcessing(ValueSelected, ChoiceSource)
	
	If ChoiceSource.FormName = "InformationRegister.FileSynchronizationSettings.Form.AddConditionsByDate" Then
		AddToFilterIntervalException(ValueSelected);
	EndIf;
	
EndProcedure

&AtClient
Procedure SynchronizationObjectOnChange(Item)
	
	SetFormItemEnabled();
	Record.FileOwner = FilesOwnerID;
	
EndProcedure

&AtClient
Procedure SyncObjectItemFilesOnChange(Item)
	
	SetFormItemEnabled();
	
EndProcedure

&AtClient
Procedure OnClose(Exit)
	
	If Exit Then
		Return;
	EndIf;
	NotifyChoice(ReturnValue);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure InitializeComposer()
	
	If Not ValueIsFilled(Record.FileOwner) Then
		Return;
	EndIf;
	
	Rule.Settings.Filter.Items.Clear();
	
	DCS = New DataCompositionSchema;
	DataSource = DCS.DataSources.Add();
	DataSource.Name = "DataSource1";
	DataSource.DataSourceType = "Local";
	
	DataSet = DCS.DataSets.Add(Type("DataCompositionSchemaDataSetQuery"));
	DataSet.Name = "DataSet1";
	DataSet.DataSource = DataSource.Name;
	
	DCS.TotalFields.Clear();
	
	DCS.DataSets[0].Query = GetQueryText();
	
	DataCompositionSchema = PutToTempStorage(DCS, UUID);
	
	Rule.Initialize(New DataCompositionAvailableSettingsSource(DataCompositionSchema));
	
	Rule.Refresh(); 
	Rule.Settings.Structure.Clear();
	
EndProcedure

&AtServer
Function GetQueryText()
	
	AttributesArrayWithDateType.Clear();
	If TypeOf(Record.FileOwner) = Type("CatalogRef.MetadataObjectIDs") Then
		ObjectType = Record.FileOwner;
	Else
		ObjectType = Common.MetadataObjectID(TypeOf(Record.FileOwner));
	EndIf;
	AllCatalogs = Catalogs.AllRefsType();
	AllDocuments = Documents.AllRefsType();
	
	QueryText = 
		"SELECT
		|	&FileOwnerFields
		|FROM
		|	&FullNameFileOwner";
	
	FileOwnerFields = ObjectType.Name + ".Ref";
	If AllCatalogs.ContainsType(TypeOf(ObjectType.EmptyRefValue)) Then
		Catalog = Metadata.Catalogs[ObjectType.Name];
		For Each Attribute In Catalog.Attributes Do
			FileOwnerFields = FileOwnerFields + "," + Chars.LF + ObjectType.Name + "." + Attribute.Name;
		EndDo;
	ElsIf AllDocuments.ContainsType(TypeOf(ObjectType.EmptyRefValue)) Then
		Document = Metadata.Documents[ObjectType.Name];
		For Each Attribute In Document.Attributes Do
			FileOwnerFields = FileOwnerFields + "," + Chars.LF + ObjectType.Name + "." + Attribute.Name;
			If Attribute.Type.ContainsType(Type("Date")) Then
				AttributesArrayWithDateType.Add(Attribute.Name, Attribute.Synonym);
				FileOwnerFields = FileOwnerFields + "," + Chars.LF 
					+ StrReplace("DATEDIFF(&AttributeName, &CurrentDate, DAY) AS DaysBeforeDeletionFrom&AttributeName",
						"&AttributeName", Attribute.Name);
			EndIf;
		EndDo;
	EndIf;
	
	QueryText = StrReplace(QueryText, "&FileOwnerFields", FileOwnerFields);
	QueryText = StrReplace(QueryText, "&FullNameFileOwner", ObjectType.FullName + " AS " + ObjectType.Name);
	Return QueryText;
	
EndFunction

&AtClient
Procedure AddConditionByDate(Command)
	
	FormParameters = New Structure;
	FormParameters.Insert("ArrayOfValues", AttributesArrayWithDateType);
	OpenForm("InformationRegister.FileSynchronizationSettings.Form.AddConditionsByDate", FormParameters, ThisObject);
	
EndProcedure

&AtServer
Procedure AddToFilterIntervalException(ValueSelected)
	
	FilterByInterval = Rule.Settings.Filter.Items.Add(Type("DataCompositionFilterItem"));
	FilterByInterval.LeftValue = New DataCompositionField("DaysBeforeDeletionFrom" + ValueSelected.DateTypeAttribute);
	FilterByInterval.ComparisonType = DataCompositionComparisonType.GreaterOrEqual;
	FilterByInterval.RightValue = ValueSelected.IntervalException;
	PresentationOfAttributeWithDateType = AttributesArrayWithDateType.FindByValue(ValueSelected.DateTypeAttribute).Presentation;
	PresentationText = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("en = 'Clean up after %1 days since %2';"), 
		ValueSelected.IntervalException, PresentationOfAttributeWithDateType);
	FilterByInterval.Presentation = PresentationText;

EndProcedure

&AtClient
Procedure SetFormItemEnabled()
	
	CatalogSynchronization = SynchronizationObject = "AllFiles";
	
#If MobileClient Then
	Items.SyncRuleGroup.Visible = CatalogSynchronization;
	Items.CatalogItem.Visible = Not CatalogSynchronization;
#Else
	Items.SyncRuleGroup.Enabled = CatalogSynchronization;
	Items.CatalogItem.Enabled = Not CatalogSynchronization;
#EndIf

EndProcedure

&AtClient
Procedure CatalogItemStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	
	ChoiceFormParameters = New Structure;
	
	ChoiceFormParameters.Insert("ChoiceFoldersAndItems", FoldersAndItemsUse.FoldersAndItems);
	ChoiceFormParameters.Insert("CloseOnChoice", True);
	ChoiceFormParameters.Insert("CloseOnOwnerClose", True);
	ChoiceFormParameters.Insert("MultipleChoice", False);
	ChoiceFormParameters.Insert("ChoiceMode", True);
	
	ChoiceFormParameters.Insert("WindowOpeningMode", FormWindowOpeningMode.LockOwnerWindow);
	ChoiceFormParameters.Insert("SelectGroups", True);
	ChoiceFormParameters.Insert("UsersGroupsSelection", True);
	
	ChoiceFormParameters.Insert("AdvancedPick", True);
	ChoiceFormParameters.Insert("PickFormHeader", NStr("en = 'Select settings items';"));
	
	FixedSettings = New DataCompositionSettings;
	SettingItem = FixedSettings.Filter.Items.Add(Type("DataCompositionFilterItem"));
	SettingItem.LeftValue = New DataCompositionField("Ref");
	SettingItem.ComparisonType = DataCompositionComparisonType.NotInList;
	SettingItem.RightValue = ExistingSettingsList;
	SettingItem.Use = True;
	SettingItem.ViewMode = DataCompositionSettingsItemViewMode.Inaccessible;
	ChoiceFormParameters.Insert("FixedSettings", FixedSettings);
	
	OpenForm(ChoiceFormPath(CatalogItem, FilesOwnerID), ChoiceFormParameters, Items.CatalogItem);
	
EndProcedure
 
&AtServerNoContext
Function ChoiceFormPath(FileOwner, FilesOwnerID)
	
	MetadataObject = Common.MetadataObjectByID(FilesOwnerID);
	Return MetadataObject.FullName() + ".ChoiceForm";
	
EndFunction

&AtServer
Function ExistingSynchronizationObjects(FileOwnerType)
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	FileSynchronizationSettings.FileOwner
		|FROM
		|	InformationRegister.FileSynchronizationSettings AS FileSynchronizationSettings
		|WHERE
		|	VALUETYPE(FileSynchronizationSettings.FileOwner) = &FileOwnerType";
	
	Query.SetParameter("FileOwnerType", FileOwnerType);
	
	QueryResult = Query.Execute();
	
	Return QueryResult.Unload().UnloadColumn("FileOwner");
	
EndFunction

&AtServer
Function HasSyncRulesSettings(FileOwner)
	
	Query = New Query;
	Query.Text = "SELECT TRUE AS HasSyncRulesSettings
		|FROM
		|	InformationRegister.FileSynchronizationSettings AS FileSynchronizationSettings
		|WHERE
		|	FileSynchronizationSettings.FileOwner = &FileOwner";
	
	Query.SetParameter("FileOwner", FileOwner);
	
	QueryResult = Query.Execute();
	
	If QueryResult.IsEmpty() Then
		Return False;
	EndIf;
	
	Result = QueryResult.Unload()[0];

	Return ValueIsFilled(Result.HasSyncRulesSettings);
	
EndFunction

&AtServer
Procedure FillSynchronizationAccount()
	
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	FileSynchronizationAccounts.Ref
		|FROM
		|	Catalog.FileSynchronizationAccounts AS FileSynchronizationAccounts
		|WHERE
		|	NOT FileSynchronizationAccounts.DeletionMark";
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	If SelectionDetailRecords.Count() = 1 Then
		While SelectionDetailRecords.Next() Do
			Record.Account = SelectionDetailRecords.Ref;
		EndDo;
	EndIf;
	
EndProcedure

#EndRegion
